# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04MGJmZjNlNi0xNmM0LTQ4MzktOWNlOC02MGMxYTgzMWNlNTI7b2JqZWN0SWQ9YjU5YWI3YjktZGIzOC00YmQzLTg2MTQtZTZkMTBhZDcwYjExO3N1YnNjcmlwdGlvbklkPTdiNmY4ZjE1LTNhM2UtNDNhMi1iNmFjLThlYjZjMDZhZDEwMzt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_role_assignment.sb_aks_ra will be created
  + resource "azurerm_role_assignment" "sb_aks_ra" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c28691c7-9899-4e43-8292-86b99b0ed3d8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.ServiceBus/namespaces/dd-test-sbn"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_windows_function_app.feedpoller will be updated in-place
  ~ resource "azurerm_windows_function_app" "feedpoller" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Web/sites/oed-test-feedpoller-func"
        name                                           = "oed-test-feedpoller-func"
        tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/oed-test-feedpoller-ai"
            "solution"                                       = "apps"
        }
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_web_app.testapp will be updated in-place
  ~ resource "azurerm_windows_web_app" "testapp" {
        id                                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Web/sites/oed-testapp-app"
        name                                           = "oed-testapp-app"
        tags                                           = {
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/oed-testapp-ai"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
            # (29 unchanged attributes hidden)

          + virtual_application {
              + physical_path = "site\wwwroot"
              + preload       = false
              + virtual_path  = "/"
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `push` |
| Working Directory | `./infra/altinn-digdir-oed-tt02-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/test/altinn-digdir-oed-tt02-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_test_altinn-digdir-oed-tt02-rg.tfstate.tfplan`